[
    {
        "_id": 1,
        "food": "Monohora",
        "img": "https://www.intepat.com/wp-content/uploads/2020/02/rasgulla.png",

        "history": "The history of Rosogolla is a tale of sweetness that transcends regional disputes and rivalries. The origins of this iconic dessert, while disputed, are deeply rooted in the culinary traditions of the Indian subcontinent. It is believed that various forms of chhena-based sweets cooked in sugar syrup existed long before the modern Rosogolla took shape.The sweet confection as we know it today gained prominence in the bustling streets of Kolkata, West Bengal, during the 19th century. A name often associated with its invention is Chandra Das, a skilled Bengali sweetmaker, who is said to have created the signature spongy, white Rosogolla. His sweet shop, K.C. Das, remains an iconic establishment, continuing to serve this beloved delicacy. However, it's essential to recognize that this version of Rosogolla is a matter of pride for Bengalis and is fiercely contested by neighboring Odisha. The state of Odisha, located to the southwest of Bengal, also claims a historical connection to Rosogolla. Odisha's supporters cite documented references to similar sweets that predate the claims of West Bengal. This culinary dispute has resulted in a contentious debate, often spilling into regional rivalry and sentiments.In 2015, the Indian government recognized the uniqueness and cultural significance of Banglar Rosogolla by granting it a Geographical Indication (GI) tag associated with West Bengal. This decision further fueled the rivalry, leading to a renewed sense of pride in Bengal. Rosogolla has continued to evolve and adapt over the years. Variations like the brown Rosogolla and the stuffed Rosogolla, which incorporates ingredients like saffron, pistachios, and jaggery, have emerged. This versatile dessert is now enjoyed throughout India and among the Indian diaspora, celebrated during festivals, special occasions, and everyday indulgences.The history of Rosogolla is a testament to the rich tapestry of Indian culture, where regional flavors and culinary traditions come together to create a universally adored sweet. While the debate over its origin persists, the sheer delight it brings to those who savor its sweet, syrupy goodness remains undisputed."
    },


    {
        "_id": 2,
        "food": "Malai Chom Chom",
        "img": "https://i.ytimg.com/vi/-3g21qlISMw/maxresdefault.jpg",

        "history": "Malai Chom Chom is a beloved Bengali sweet with a rich history rooted in the culinary traditions of West Bengal, India. Its origins can be traced back to the same roots as the famous Bengali sweet Rasgulla, as it is made from fresh chhena or cheese curd. Chom Chom is renowned for its luxurious and creamy texture, which sets it apart from its close relative. The process of making Malai Chom Chom involves shaping chhena into cylindrical or oval forms, gently cooking them in sugar syrup, and then immersing them in a sweet, thickened milk or malai. The result is a dessert that embodies the essence of sweetness and indulgence. It has become an integral part of Bengali sweet culture, often gracing special occasions and festive celebrations, and remains a symbol of the rich culinary heritage of West Bengal.la by granting it a Geographical Indication (GI) tag associated with West Bengal. This decision further fueled the rivalry, leading to a renewed sense of pride in Bengal. Rosogolla has continued to evolve and adapt over the years. Variations like the brown Rosogolla and the stuffed Rosogolla, which incorporates ingredients like saffron, pistachios, and jaggery, have emerged. This versatile dessert is now enjoyed throughout India and among the Indian diaspora, celebrated during festivals, special occasions, and everyday indulgences.The history of Rosogolla is a testament to the rich tapestry of Indian culture, where regional flavors and culinary traditions come together to create a universally adored sweet. While the debate over its origin persists, the sheer delight it brings to those who savor its sweet, syrupy goodness remains undisputed."
    }
]